{
  "terms": [
    {
      "term": "ANS-104",
      "definition": "A standard for bundled data on Arweave, allowing for efficient storage of multiple pieces of data in a single transaction. It forms the basis for scalable data storage and retrieval on the network.",
      "category": "Arweave Technology",
      "related": ["Bundling", "Transaction", "Data Storage", "Base Layer Transaction"],
      "aliases": ["Bundled Data Standard", "Arweave Network Standard 104"],
      "docs": ["https://specs.g8way.io/?tx=xwOgX-MmqN5_-Ny_zNu2A8o-PnTGsoRb_3FrtiMAkuw"]
    },
    {
      "term": "Messaging Patterns",
      "definition": "Communication frameworks in AO that define how processes exchange information through message passing. These patterns include asynchronous fire-and-forget messaging (ao.send), request-response cycles (ao.send().receive()), message forwarding chains (msg.forward), and various blocking and non-blocking communication models. Messaging patterns provide structured approaches for inter-process communication, enabling complex distributed systems to coordinate effectively.",
      "category": "AO Core Concepts",
      "related": ["Message", "Process", "ao.send", "msg.reply", "msg.forward", "Reference"],
      "aliases": ["Communication Patterns", "Message Exchange Patterns"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "ao.send",
      "definition": "A non-blocking function in AO for asynchronous message sending that enables fire-and-forget communication between processes. It returns immediately after sending, allowing the sending process to continue execution without waiting for a response. The function returns a promise-like object that can be chained with .receive() for request-response patterns when needed.",
      "category": "AO Development",
      "related": ["Message", "Process", "ao.send().receive()", "Non-blocking Communication"],
      "aliases": ["Send Function", "Asynchronous Send"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "ao.send().receive()",
      "definition": "A blocking message pattern in AO that combines sending a message and waiting for a specific reply, enabling request-response cycles between processes. It only matches messages linked by X-Reference and can specify a target process ID to indicate which process will reply. This pattern is essential for synchronous interactions in the otherwise asynchronous AO environment.",
      "category": "AO Development",
      "related": ["ao.send", "Message", "X-Reference", "Blocking Communication"],
      "aliases": ["Request-Response Pattern", "Blocking Receive"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "msg.reply",
      "definition": "A non-blocking function in AO handlers used to respond to incoming messages with automatic reference tracking. It enables asynchronous request-response patterns by automatically linking the response to the original message via X-Reference and setting the Target to the original sender or Reply-To address if specified.",
      "category": "AO Development",
      "related": ["Message", "Handler", "X-Reference", "Reply-To"],
      "aliases": ["Reply Function", "Message Response"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "msg.forward",
      "definition": "A non-blocking function in AO for message routing across multiple processes that creates a sanitized copy of the original message. It preserves Reply-To and X-Reference properties for complete message tracking and sets X-Origin to the original sender, enabling final services to reply directly to the originator. This function is key for creating multi-step processing pipelines (A → B → C → A patterns).",
      "category": "AO Development",
      "related": ["Message", "X-Reference", "X-Origin", "Message Forwarding"],
      "aliases": ["Forward Function", "Message Routing"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "Receive",
      "definition": "A blocking function in AO (with capital R) that pauses execution until any message matching a specified pattern arrives from any sender. Unlike the lowercase .receive() method, it's not bound to a specific conversation and can match messages from any process, making it useful for synchronous message processing flows or event listening.",
      "category": "AO Development",
      "related": ["Message", "Pattern Matching", "Blocking Communication"],
      "aliases": ["Capital-R Receive", "Pattern Matcher"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "Handlers.utils.reply",
      "definition": "A utility function in AO that creates a handler function that automatically replies with a fixed response. It serves as a wrapper around msg.reply for common use cases, enabling concise creation of simple response handlers without writing full handler functions.",
      "category": "AO Development",
      "related": ["Handler", "msg.reply", "Message"],
      "aliases": ["Auto-reply Utility", "Reply Handler Creator"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "Reference",
      "definition": "A unique identifier automatically assigned to each message in AO that enables tracking message history and relationships. References form the foundation of AO's message correlation system, allowing processes to maintain conversation context across asynchronous communications.",
      "category": "AO Core Concepts",
      "related": ["Message", "X-Reference", "Message Chain"],
      "aliases": ["Message ID", "Message Reference"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "Reply-To",
      "definition": "A message property in AO that explicitly specifies the destination for responses, overriding the default behavior of replying to the original sender. This enables more flexible routing patterns where responses can be directed to different processes than the message originator.",
      "category": "AO Core Concepts",
      "related": ["Message", "msg.reply", "Message Routing"],
      "aliases": ["Response Destination", "Reply Address"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "X-Reference",
      "definition": "A special message property in AO that maintains conversation chains across replies and forwards. It links related messages together in a conversation, enabling processes to track which response corresponds to which request, even in complex multi-step processing pipelines.",
      "category": "AO Core Concepts",
      "related": ["Reference", "Message", "Message Chain", "X-Origin"],
      "aliases": ["Conversation Reference", "Message Chain ID"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "X-Origin",
      "definition": "A message property in AO that tracks the original sender of a message through forwarding chains. It enables final services in a processing pipeline to reply directly to the conversation originator without knowing its specific identity in advance, facilitating multi-step processing workflows.",
      "category": "AO Core Concepts",
      "related": ["Message", "msg.forward", "X-Reference"],
      "aliases": ["Original Sender", "Message Originator"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "Blocking Communication",
      "definition": "A messaging approach in AO where the sending process pauses execution until a response is received. This pattern is implemented through functions like Receive and ao.send().receive(), creating synchronous interaction points in an otherwise asynchronous system. Blocking is useful for scenarios requiring guaranteed order of operations or direct response handling.",
      "category": "AO Core Concepts",
      "related": ["Receive", "ao.send().receive()", "Non-blocking Communication"],
      "aliases": ["Synchronous Communication", "Blocking Messaging"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "Non-blocking Communication",
      "definition": "A messaging approach in AO where the sending process continues execution immediately after sending a message, without waiting for responses. Implemented through functions like ao.send, msg.reply, and msg.forward, this pattern enables parallel processing and higher throughput in distributed systems by avoiding execution pauses.",
      "category": "AO Core Concepts",
      "related": ["ao.send", "msg.reply", "msg.forward", "Blocking Communication"],
      "aliases": ["Asynchronous Communication", "Non-blocking Messaging"],
      "docs": ["https://cookbook_ao.arweave.net/references/messaging.html"]
    },
    {
      "term": "Process",
      "definition": "A computational unit in AO that can receive and send messages. Processes are represented by a log of interacting messages stored on Arweave, as well as an initialization data item.",
      "category": "AO Core Concepts",
      "related": ["Message", "Spawn", "Process ID", "Actor Model"],
      "aliases": ["AO Process", "Actor", "Smart Contract"],
      "docs": ["https://cookbook_ao.arweave.net/concepts/processes.html"]
    },
    {
      "term": "Message",
      "definition": "The fundamental unit of communication in AO and the Converge Protocol. In AO, messages are ANS-104 compliant data items that can be sent between processes or from users to processes. In the Converge Protocol, every item on the permaweb is described as a Message, interpretable as either a map of named functions or as a concrete binary term. Messages can be called through the creation of another message, providing a map of arguments to the execution. Both systems use messages as the primary mechanism for communication and state management.",
      "category": "AO Core Concepts",
      "related": ["Process", "Tags", "Handler", "Outbox", "Converge Protocol", "Device", "Hashpath", "Path"],
      "aliases": ["AO Message", "Converge Message"],
      "docs": ["https://cookbook_ao.arweave.net/concepts/messages.html"]
    },
    {
      "term": "Handler",
      "definition": "A function in an AO process that responds to specific message patterns. Handlers are registered to match particular message patterns and execute code when matching messages are received.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Pattern Matching"],
      "aliases": ["Message Handler"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "Resolvers",
      "definition": "Special tables in AO handlers where each key is a pattern matching table and its corresponding value is a function that executes when that pattern matches. Resolvers enable conditional execution based on additional pattern matching, creating switch/case-like structures where different functions are triggered based on which pattern matches the incoming message.",
      "category": "AO Development",
      "related": ["Handler", "Pattern Matching Tables", "Message", "Handler Pattern"],
      "aliases": ["Handler Resolvers", "Conditional Handlers"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "Pattern Matching Tables",
      "definition": "Declarative structures in AO that define how to match incoming messages based on their attributes. These tables support simple tag matching, wildcard matching with underscore ('_'), Lua string pattern matching (similar to regex), and function-based validation. They provide a flexible way to filter messages for processing by specific handlers.",
      "category": "AO Development",
      "related": ["Handler", "Message", "Handler Pattern", "Resolvers"],
      "aliases": ["Message Matching Tables", "Tag Matching Patterns"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "Handlers.utils.hasMatchingData",
      "definition": "A utility function in AO that returns a pattern matching function for checking if a message's Data field contains a specified string. This helper simplifies creating handlers that respond to specific message content rather than just tags, enabling content-based message routing and processing.",
      "category": "AO Development",
      "related": ["Handler", "Message", "Handlers.utils.reply", "Handlers.utils.hasMatchingTag"],
      "aliases": ["Data Matcher", "Content Matcher"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "Handlers.utils.hasMatchingTag",
      "definition": "A utility function in AO that returns a pattern matching function for checking if a message has a tag with a specified name and value. This helper enables precise matching of messages based on their tag attributes, facilitating targeted message handling and routing in AO processes.",
      "category": "AO Development",
      "related": ["Handler", "Message", "Handlers.utils.reply", "Handlers.utils.hasMatchingData"],
      "aliases": ["Tag Matcher", "Tag Validator"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "Handlers.add",
      "definition": "A core function in AO for registering message handlers that takes a name, pattern, and handler function as arguments. It adds or updates a handler in the process's handler list, enabling processes to respond to specific message patterns. The pattern can be a table, function, or string (in AOS 2.0+), and the handler can be a function or resolver table for conditional execution.",
      "category": "AO Development",
      "related": ["Handler", "Pattern Matching Tables", "Resolvers", "Message"],
      "aliases": ["Add Handler", "Register Handler"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "Handlers.once",
      "definition": "A specialized handler registration function in AO that creates a handler which runs only once when its pattern is matched, then is automatically removed. This is equivalent to setting maxRuns = 1 and is useful for one-time initialization or handling unique events that should trigger only a single response.",
      "category": "AO Development",
      "related": ["Handler", "Handlers.add", "Pattern Matching Tables", "Message"],
      "aliases": ["Single-Run Handler", "One-Time Handler"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "Handler Execution Flow",
      "definition": "The process by which AO determines which handlers to run when a message arrives. Handlers are executed in sequential order as they appear in the Handlers.list, with pattern functions determining whether to: skip the handler (false), process the message and continue checking subsequent handlers (\"continue\"), or process the message and stop checking further handlers (\"break\"). This flow control enables sophisticated message processing pipelines within AO processes.",
      "category": "AO Core Concepts",
      "related": ["Handler", "Message", "Pattern Matching Tables", "Handlers.add"],
      "aliases": ["Handler Pipeline", "Execution Order", "Handler Processing Flow"],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html"]
    },
    {
      "term": "ArFS",
      "definition": "A data modeling, storage, and retrieval protocol designed to emulate common file system operations on Arweave's permanent storage. ArFS solves key challenges by implementing a hierarchical file structure, metadata management, file permissions (public and private with encryption), file versioning, data deduplication, search capabilities, and interoperability with other decentralized applications. It works around Arweave's immutable nature by using an append-only transaction data model with tags in Arweave Transaction headers, enabling features like file renaming and organization despite the underlying permanent storage.",
      "category": "Arweave Technology",
      "related": ["Arweave", "Data Storage", "Metadata", "Tags", "Transaction", "Permanent Storage", "ArDrive", "File System"],
      "aliases": ["Arweave File System"],
      "docs": ["https://cookbook.ar.io/concepts/arfs/arfs.html", "https://ardrive.io/arfs/"]
    },
    {
      "term": "Spawn",
      "definition": "The action of creating a new process in AO. Processes can spawn other processes, creating a hierarchical relationship.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Module"],
      "aliases": ["Create Process"],
      "docs": []
    },
    {
      "term": "Actor Model",
      "definition": "The computational paradigm that AO is based on, where each process (actor) is an independent unit with its own state that communicates exclusively through message passing.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Concurrency"],
      "aliases": ["Actor-Oriented", "Actor Oriented", "Actor-Oriented Programming"],
      "docs": []
    },
    {
      "term": "HyperBEAM",
      "definition": "The distributed execution engine that powers AO, built on Erlang/OTP. It provides distributed computation, deterministic execution, message scheduling, and WASM runtime capabilities.",
      "category": "AO Core Infrastructure",
      "related": ["AO Computer", "AO-Core Protocol", "Compute Unit", "Scheduler Unit"],
      "aliases": ["AO Execution Engine", "Distributed Runtime"],
      "docs": []
    },
    {
      "term": "Arweave Wallet Kit",
      "definition": "A modular toolkit that simplifies interactions between Arweave wallets and dApps by providing a unified API that supports any Arweave wallet. It's built around a core package as the foundation, with additional packages for React hooks, components, and styles. The kit uses 'strategies' as modular implementations for different wallet providers, currently supporting Wander.app, Arweave.app, Othent, and general browser wallets. This architecture enables users to interact with apps using their preferred wallet while giving developers a consistent interface across all wallet types.",
      "category": "Arweave Ecosystem",
      "related": ["ArweaveKit", "Wallet", "Transactions", "Authentication", "dApp Development"],
      "aliases": ["AWK", "Wallet Kit"],
      "docs": ["https://docs.arweavekit.com/arweave-wallet-kit/introduction"]
    },
    {
      "term": "Compute Unit",
      "definition": "A node in the AO network responsible for executing process code and managing state. CUs offer the service of resolving process state in competition with one another.",
      "category": "AO Infrastructure",
      "related": ["HyperBEAM", "Scheduler Unit", "Messenger Unit", "Process", "State Management"],
      "aliases": ["CU", "Compute Units"],
      "docs": []
    },
    {
      "term": "Scheduler Unit",
      "definition": "A node in the AO network responsible for the single assignment of atomically incrementing slot numberings to messages sent to a process, ensuring deterministic ordering.",
      "category": "AO Infrastructure",
      "related": ["Compute Unit", "Messenger Unit", "Message", "Message Ordering"],
      "aliases": ["SU", "AO Scheduler Node", "Scheduler Units"],
      "docs": []
    },
    {
      "term": "Messenger Unit",
      "definition": "A node in the AO network that relays messages around the system, serving as the entry point for users to interact with processes within AO.",
      "category": "AO Infrastructure",
      "related": ["Compute Unit", "Scheduler Unit", "Message", "Process Communication"],
      "aliases": ["MU", "AO Message Node", "Messenger Units"],
      "docs": []
    },
    {
      "term": "Cron",
      "definition": "A time-based job scheduler in AO that enables processes to execute functions on a schedule, allowing for autonomous contract execution.",
      "category": "AO Features",
      "related": ["Process", "Autonomous Execution", "Agent"],
      "aliases": ["Scheduled Execution"],
      "docs": ["https://cookbook_ao.arweave.net/references/cron.html"]
    },
    {
      "term": "Holographic State",
      "definition": "A state management approach in AO where consensus is achieved on message inputs rather than computation outputs. This allows process state to be reconstructed from message logs without requiring all nodes to execute every computation.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "State Management"],
      "aliases": ["Holographic Computation", "State Projection"],
      "docs": []
    },
    {
      "term": "AOS",
      "definition": "The AO operating system, which serves as a reference model for software creation on AO. It allows developers to initiate processes, install packages, and edit code within a live environment.",
      "category": "AO Development",
      "related": ["AO-Core Protocol", "Process", "Lua"],
      "aliases": ["AO Operating System"],
      "docs": []
    },
    {
      "term": "Arweave",
      "definition": "A decentralized storage network that allows users to store data permanently and sustainably. It serves as the foundation layer for the permaweb ecosystem and has its own native cryptocurrency called AR Token that powers the network's economic model.",
      "category": "Arweave Core Infrastructure",
      "related": ["Blockweave", "Permaweb", "AR Token", "Proof of Access", "ANS-104"],
      "aliases": ["AR Network", "Permanent Storage Network"],
      "docs": []
    },
    {
      "term": "Blockweave",
      "definition": "The data structure used by Arweave to store and validate data. Unlike traditional blockchains, it enables efficient access to historical data through its unique weave structure.",
      "category": "Arweave Technology",
      "related": ["Arweave", "Proof of Access", "SPoRA", "Data Storage", "Weave"],
      "aliases": ["Weave Structure", "AR Blockweave"],
      "docs": []
    },
    {
      "term": "Permaweb",
      "definition": "A permanent, decentralized web built on top of the Arweave network, allowing for the creation of websites and applications that are accessible forever. It represents the user-facing layer of the Arweave ecosystem.",
      "category": "Arweave Ecosystem",
      "related": ["Arweave", "AR.IO", "Gateway", "ArNS", "Permanent Storage"],
      "aliases": ["Permanent Web", "Decentralized Web"],
      "docs": []
    },
    {
      "term": "AR.IO",
      "definition": "The first permanent cloud network. No 404s, no lost dependencies, no subscriptions - just reliable access to applications and data for site and app hosting.",
      "category": "AR.IO Infrastructure",
      "related": ["Gateway", "Gateway Address Registry", "Protocol Balance", "Wayfinder Protocol", "Layer 2 Infrastructure"],
      "aliases": ["Arweave I/O", "ARIO"],
      "docs": ["https://ar.io/"]
    },
    {
      "term": "AR.IO Gateway",
      "definition": "A server that provides access to data stored on the Arweave network. Part of the AR.IO network's decentralized infrastructure for serving permanent data and managing network traffic.",
      "category": "AR.IO Infrastructure",
      "related": ["AR.IO", "Gateway Address Registry", "Wayfinder Protocol", "Data Retrieval"],
      "aliases": [],
      "docs": ["https://docs.ar.io/build/gateways#overview"]
    },
    {
      "term": "Bundling",
      "definition": "A feature in Arweave that groups multiple data transactions together, processing them as Layer-1 transactions to improve efficiency and reduce costs. This is implemented through the ANS-104 standard.",
      "category": "Arweave Technology",
      "related": ["ANS-104", "Transaction", "Base Layer Transaction", "Data Upload"],
      "aliases": ["Transaction Bundling", "Data Bundling"],
      "docs": []
    },
    {
      "term": "AO Token",
      "definition": "The native token of the AO ecosystem, used for resource allocation, governance, and payments within the network. One AO is equal to one trillion (1,000,000,000,000) Armstrongs, which is the smallest unit of the token. When specifying token quantities in transactions, the amount is typically expressed in Armstrongs rather than AO (e.g., 1,000,000 Armstrongs = 0.0000001 AO).",
      "category": "AO Economics",
      "related": ["Pi Token", "Delegation", "Compute Payment", "Armstrong"],
      "aliases": ["$AO"],
      "docs": []
    },
    {
      "term": "Pi Token (π)",
      "definition": "A token in the AO ecosystem representing ownership of key permaweb assets, including AO, AR, and fair-launch projects, serving as a default means of exchange.",
      "category": "AO Economics",
      "related": ["AO Token", "AR Token", "Permaweb Index"],
      "aliases": ["$PI", "$π", "Permaweb Index"],
      "docs": []
    },
    {
      "term": "AO-SQLite",
      "definition": "A module for AO that combines the AO operating system with SQLite to create a lightweight but powerful indexer for the AOS experience.",
      "category": "AO Development",
      "related": ["AOS", "SQLite", "Indexing"],
      "aliases": ["AOS-SQLite"],
      "docs": []
    },
    {
      "term": "ArFleet",
      "definition": "A framework in AO designed to facilitate the purchase of time-limited data storage from permissionless peers without requiring third-party enforcement.",
      "category": "AO Core Concepts",
      "related": ["Storage Provider", "Storage Client", "Deal Process"],
      "aliases": ["Time-limited Storage"],
      "docs": []
    },
    {
      "term": "Trusted Execution Environment",
      "definition": "A secure area of a processor in AO that guarantees code and data loaded inside is protected with respect to confidentiality and integrity, similar to a CPU with the security of a hardware wallet.",
      "category": "AO Security",
      "related": ["Security Model", "Attestation", "Hardware Security"],
      "aliases": ["TEE"],
      "docs": []
    },
    {
      "term": "ArNS",
      "definition": "A decentralized domain name system for the permaweb.",
      "category": "AR.IO Ecosystem",
      "related": ["Permaweb", "Gateway", "AR.IO"],
      "aliases": ["Arweave Name System"],
      "docs": []
    },
    {
      "term": "Assignments",
      "definition": "A mechanism in AO that enables processes to access and share data from Arweave. Assignments allow processes to request specific data items by their transaction IDs and distribute messages to multiple processes. They are implemented through the ao module's assign and send functions, supporting features like data loading and cross-process message sharing.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "ao Module", "Data Access"],
      "aliases": ["Process Assignments", "Message Assignment"],
      "docs": ["https://cookbook_ao.arweave.net/references/data.html"]
    },
    {
      "term": "ao Module",
      "definition": "A core library in AO that provides essential functionality for process communication and management. It includes functions for sending messages (ao.send), spawning processes (ao.spawn), managing assignments, and handling process state. The module maintains process environment information and manages message routing through an outbox system.",
      "category": "AO Development",
      "related": ["Process", "Message", "Assignments", "Environment"],
      "aliases": ["AO Library", "Core Module"],
      "docs": ["https://cookbook_ao.arweave.net/references/ao.html"]
    },
    {
      "term": "AO Computer",
      "definition": "The AO Computer is an actor-oriented machine on the Arweave network, creating a unified computing environment across diverse nodes. It supports many parallel processes through an open message-passing layer, linking independent processes into a cohesive system, similar to how websites are interconnected via hyperlinks.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "AO-Core Protocol", "Process", "Actor Model", "Message"],
      "aliases": ["AO", "Actor-Oriented Computer"],
      "docs": []
    },
    {
      "term": "Arweave Name Token",
      "definition": "A token based on the AO Computer that is connected to each registered ArNS Name. Each ANT gives the owner the ability to update the subdomains and Arweave Transaction IDs used by the registered name as well as transfer ownership and other functions.",
      "category": "Arweave Ecosystem",
      "related": ["ArNS", "AO Computer", "Token"],
      "aliases": ["ANT", "Name Token"],
      "docs": []
    },
    {
      "term": "Arweave Network Standards",
      "definition": "Drafts and finalized standards for data formats, tag formats, data protocols, custom gateway features and anything that is built on top the Arweave Network. Specific standards are denoted by an associated number, e.g., ANS-###.",
      "category": "Arweave Technology",
      "related": ["Arweave", "Data Protocols", "Standards"],
      "aliases": ["ANS"],
      "docs": []
    },
    {
      "term": "Base Layer Transaction",
      "definition": "One of up to 1,000 transactions that make up a single Arweave block. These transactions form the foundation of the Arweave network's data structure and can contain bundled data items.",
      "category": "Arweave Technology",
      "related": ["Bundling", "Transaction", "Block", "ANS-104", "Blockweave"],
      "aliases": ["L1 Transaction", "Core Transaction"],
      "docs": []
    },
    {
      "term": "Bundled Data Item",
      "definition": "A data item or transaction nested within an ANS-104 bundled transaction. These items enable efficient storage and retrieval of multiple data pieces within the Arweave network.",
      "category": "Arweave Technology",
      "related": ["ANS-104", "Bundling", "Base Layer Transaction", "Data Storage"],
      "aliases": ["BDI", "Nested Transaction"],
      "docs": []
    },
    {
      "term": "Bundler",
      "definition": "A third-party service and gateway feature that bundles data files on a user's behalf.",
      "category": "Arweave Ecosystem",
      "related": ["Bundling", "Gateway", "Data Upload"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Chunk",
      "definition": "A unit of data that is stored on the Arweave network. It represents a piece of a larger file that has been split into smaller, manageable segments for efficient storage and retrieval.",
      "category": "Arweave Technology",
      "related": ["Data Storage", "Data Retrieval", "Arweave"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Epoch",
      "definition": "A specific duration (e.g., one day) during which network activities and evaluations are conducted. It serves as a key time frame for processes such as observation duties, performance assessments, and reward distributions within the network's protocols.",
      "category": "Infrastructure",
      "related": ["Protocol", "Network Activities", "Rewards"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Eval",
      "definition": "An onboard handler in AO processes that evaluates new code and verifies message origin. It processes incoming code, determines appropriate actions, and can be manually triggered to evaluate the Data field from messages. The Eval handler is also used internally by functions like .load to evaluate file contents.",
      "category": "AO Core Concepts",
      "related": ["Process", "Handler", "Message", "Security Model"],
      "aliases": ["Eval Handler", "Code Evaluator"],
      "docs": ["https://cookbook_ao.arweave.net/concepts/eval.html"]
    },
    {
      "term": "Gateway Address Registry",
      "definition": "A decentralized directory maintained in the AR.IO smart contract. It serves as the authoritative list of all registered gateways on the AR.IO Network, facilitating discovery, health monitoring, and data sharing.",
      "category": "AR.IO Infrastructure",
      "related": ["AR.IO", "Gateway", "Protocol Balance", "Staking"],
      "aliases": ["GAR", "AR.IO Registry"],
      "docs": []
    },
    {
      "term": "Indexing",
      "definition": "The act of organizing transaction data tags into queryable databases.",
      "category": "Arweave Technology",
      "related": ["Tags", "Data Retrieval", "Query"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Layer 2 Infrastructure",
      "definition": "Technology / infrastructure stack built 'above' a base layer. In this use, the AR.IO Network would be considered Layer 2 infrastructure to the base Arweave protocol.",
      "category": "AO Core Infrastructure",
      "related": ["Base Layer Transaction", "AR.IO", "Protocol"],
      "aliases": ["L2"],
      "docs": []
    },
    {
      "term": "Manifest",
      "definition": "Special 'aggregate' files uploaded to Arweave that map user-definable sub-paths with other Arweave transaction IDs. This allows users to create logical groups of content, for example a directory of related files, or the files and assets that make up a web page or application.",
      "category": "Arweave Technology",
      "related": ["Path Manifest", "Transaction ID", "Content Mapping"],
      "aliases": ["Path Manifest", "Arweave Manifest"],
      "docs": ["https://github.com/ar-io/specs/blob/c338593c618aa8dd5c3dfcd180eecf49e68b4ded/manifests/path-manifest-schema.md"]
    },
    {
      "term": "Mempool",
      "definition": "Short for 'memory pool,' is a component of Arweave mining nodes that temporarily stores valid transactions that have been broadcasted to the network but have not yet been added to a block.",
      "category": "Arweave Technology",
      "related": ["Transaction", "Block", "Mining"],
      "aliases": ["Memory Pool"],
      "docs": []
    },
    {
      "term": "Native Address",
      "definition": "The way public addresses are commonly (or by spec) represented in their native blockchain. Arweave keys are 43 character base64url representations of the public key, while Ethereum keys use a different hashing algorithm and start with 0x etc.",
      "category": "Infrastructure",
      "related": ["Public Key", "Address", "Normalized Address"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Normalized Address",
      "definition": "43 character base64url representation of the sha256 hash of a public key. Public keys for other chains can be normalized by this representation.",
      "category": "Infrastructure",
      "related": ["Native Address", "Public Key", "Address"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Observer",
      "definition": "A gateway selected to evaluate the performance of peer gateways in resolving ArNS names. Observers assess and report on the operational efficacy of other gateways.",
      "category": "AR.IO Ecosystem",
      "related": ["Gateway", "ArNS", "Performance Assessment"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Optimistic Indexing",
      "definition": "Indexing transaction or data item headers before the associated L1 transaction has been accepted and confirmed in a chain block.",
      "category": "Arweave Technology",
      "related": ["Indexing", "Base Layer Transaction", "Block"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Period",
      "definition": "A predefined time span (e.g., a day) that serves as a cycle for network activities such as dynamic pricing. It is a fundamental unit of time for operational and protocol processes within the network.",
      "category": "Infrastructure",
      "related": ["Epoch", "Network Activities", "Protocol"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Permanent Cloud Network",
      "definition": "A decentralized network that securely stores, distributes, and serves data and applications in a timeless, tamper-proof, and universally accessible way. Unlike traditional clouds, it ensures data permanence and user sovereignty by eliminating reliance on centralized providers and creating a resilient, censorship-resistant infrastructure.",
      "category": "AO Core Infrastructure",
      "related": ["Permaweb", "Decentralization", "Data Storage"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Process ID",
      "definition": "Every process in AO is assigned a unique immutable identifier code.",
      "category": "AO Core Concepts",
      "related": ["Process", "AO Computer", "Identifier"],
      "aliases": ["PID"],
      "docs": []
    },
    {
      "term": "Protocol Balance",
      "definition": "The primary sink and source of ARIO tokens circulating through the AR.IO Network. This balance functions as a programmatically encoded vault in the network's smart contract for managing ArNS revenue and incentive rewards distribution.",
      "category": "AR.IO Infrastructure",
      "related": ["ARIO Token", "AR.IO", "Protocol Rewards", "Staking"],
      "aliases": ["AR.IO Treasury", "Network Balance"],
      "docs": []
    },
    {
      "term": "Protocol Rewards",
      "definition": "ARIO Token incentive rewards distributed by the AR.IO protocol to eligible users and gateway operators, forming part of the network's economic incentive structure.",
      "category": "AR.IO Economics",
      "related": ["ARIO Token", "Protocol Balance", "Gateway", "Staking"],
      "aliases": ["AR.IO Rewards", "Gateway Rewards"],
      "docs": []
    },
    {
      "term": "Public Key",
      "definition": "The publicly known keys for a signer (wallet). Public keys are different byte lengths depending on the signer type (e.g. Arweave vs. Ethereum (ECDSA), vs Solana, etc.)",
      "category": "Infrastructure",
      "related": ["Native Address", "Normalized Address", "Wallet"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Seeding",
      "definition": "The act of propagating new data throughout the network. Miner nodes seed Arweave base layer transaction data to other miners, while gateways ensure that the transactions they receive reach the Arweave nodes. Both gateways and Arweave nodes seed base layer transactions and data chunks.",
      "category": "Arweave Technology",
      "related": ["Data Propagation", "Gateway", "Mining"],
      "aliases": ["Data Propagation"],
      "docs": []
    },
    {
      "term": "Staking",
      "definition": "The process of locking ARIO tokens into a protocol-facilitated vault, temporarily removing them from circulation until unlocked. This action represents an opportunity cost for the gateway operator and serves as a motivator to prioritize the network's collective interests.",
      "category": "Arweave Ecosystem",
      "related": ["ARIO Token", "Protocol Balance", "Vault"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Stake Redelegation",
      "definition": "The process by which stakers move their delegated tokens from one gateway to another.",
      "category": "Arweave Ecosystem",
      "related": ["Staking", "Gateway", "ARIO Token"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Stake Redemption",
      "definition": "A feature allowing stakers to use their staked tokens for ArNS-related activities, such as purchasing names, extending leases, or increasing undername capacity.",
      "category": "Arweave Ecosystem",
      "related": ["Staking", "ArNS", "ARIO Token"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Transaction ID",
      "definition": "Every transaction and data file uploaded to Arweave is assigned a unique identifier code known as the Transaction ID.",
      "category": "Arweave Technology",
      "related": ["Transaction", "Data Upload", "Identifier"],
      "aliases": ["txID"],
      "docs": []
    },
    {
      "term": "Trust-minimization",
      "definition": "Relates to enacting network security by minimizing the number of entities and the degree to which they must be trusted to achieve reliable network interactions. A network with trust-minimizing mechanisms means that it has reduced exposure to undesirable third-party actions and built-in incentives to reward good behavior while punishing bad behavior.",
      "category": "AO Core Infrastructure",
      "related": ["Security", "Decentralization", "Network"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Vault",
      "definition": "Token vaults are protocol level mechanisms used to contain staked tokens over time. Each vault contains a starting timestamp, ending timestamp (if applicable), along with a balance of tokens.",
      "category": "Arweave Ecosystem",
      "related": ["Staking", "ARIO Token", "Protocol Balance"],
      "aliases": ["Token Vault"],
      "docs": []
    },
    {
      "term": "Wayfinder Protocol",
      "definition": "The Wayfinder protocol provides applications with a pattern for dynamically switching / routing between network gateways. It also allows for abstraction of top level domain names from Arweave data and verifies the responses from AR.IO Gateways. It forms the basis of the ar:// schema, so users can seamlessly access ArNS names, Arweave base layer transactions, and bundled data items without the user providing a top-level domain.",
      "category": "Arweave Ecosystem",
      "related": ["Gateway", "ArNS", "AR.IO"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Bootloader",
      "definition": "A feature in AO that enables users to include a script to evaluate when spawning a process. The script can be included either with the Data property or with a txId specified on the On-Boot Tag.",
      "category": "AO Development",
      "related": ["Process", "Spawn", "Module"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Coroutine",
      "definition": "A programming feature in AO similar to async/await or generators, allowing processes to pause execution (yield) and resume later. Used for handling asynchronous operations and message passing.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Handler"],
      "aliases": ["Yield", "Resume"],
      "docs": []
    },
    {
      "term": "Handler Pattern",
      "definition": "A mechanism in AO for matching and processing incoming messages based on their attributes. Can be defined using strings, tables, or functions to match message properties like Action tags.",
      "category": "AO Development",
      "related": ["Handler", "Message", "Pattern Matching"],
      "aliases": ["Message Pattern", "Pattern Matcher"],
      "docs": []
    },
    {
      "term": "Resolver",
      "definition": "A special table in AO handlers where each key is a pattern matching table and its corresponding value is a function that executes when that pattern matches, enabling conditional execution based on message attributes.",
      "category": "AO Development",
      "related": ["Handler", "Handler Pattern", "Pattern Matching"],
      "aliases": [],
      "docs": ["https://cookbook_ao.arweave.net/references/handlers.html#resolvers"]
    },
    {
      "term": "WeaveDrive",
      "definition": "A protocol (AOP-5) that provides virtual file system support for AO processes to efficiently read data directly from Arweave. It enables processes to access and manipulate data stored on Arweave through a standardized file system interface, with support for lazy loading, caching, and deterministic data access patterns. The protocol includes mechanisms for data attestation, availability verification, and process boot loading.",
      "category": "AO Core Infrastructure",
      "related": ["AO Process", "Arweave", "Data Protocol", "Attestation", "File System"],
      "aliases": ["AOP-5", "WeaveDrive Protocol"],
      "docs": ["https://cookbook_ao.arweave.net/guides/snacks/weavedrive.html"]
    },
    {
      "term": "Attestor",
      "definition": "An Arweave wallet address authorized to create attestation data items that grant access to specific Arweave data items using WeaveDrive.",
      "category": "AO Security",
      "related": ["WeaveDrive", "Data Item", "Security Model"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Token Subledger",
      "definition": "A process type in AO that implements the full messaging protocol of token contracts and enables splitting tokens from a parent process into a child process while maintaining fungibility.",
      "category": "AO Economics",
      "related": ["Token", "Process", "Message Protocol"],
      "aliases": ["Child Token Process"],
      "docs": []
    },
    {
      "term": "Message Reference",
      "definition": "A unique identifier assigned to messages in AO that enables tracking message chains and responses across processes, facilitating request-response patterns and message forwarding.",
      "category": "AO Core Concepts",
      "related": ["Message", "Handler", "Process"],
      "aliases": ["X-Reference", "Reference Tag"],
      "docs": []
    },
    {
      "term": "Message Forward",
      "definition": "A mechanism in AO that enables passing messages between multiple processes while maintaining reference chains and origin information, useful for creating multi-step processing pipelines.",
      "category": "AO Core Concepts",
      "related": ["Message", "Message Reference", "Process"],
      "aliases": ["Forward", "Message Pipeline"],
      "docs": []
    },
    {
      "term": "Assignment Check",
      "definition": "A security feature in AO that provides whitelisted assignment protection for processes by verifying the trustworthiness of message assignments.",
      "category": "AO Security",
      "related": ["Process", "Message", "Security Model"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "AO Environment",
      "definition": "The core runtime environment in AO that manages process state, message handling, and execution context. It includes process identification, module references, authorities, and outbox management for coordinating process communication.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Module", "Outbox"],
      "aliases": ["ao.env", "Process Environment"],
      "docs": []
    },
    {
      "term": "Process Authority",
      "definition": "A security mechanism in AO that defines which entities (identified by their addresses) are trusted to interact with a process. Authorities can send messages that will be accepted and processed by the process.",
      "category": "AO Security",
      "related": ["Process", "Security Model", "Trust-minimization"],
      "aliases": ["Authority", "Trusted Entity"],
      "docs": []
    },
    {
      "term": "Process Outbox",
      "definition": "A component of an AO process that temporarily stores outgoing messages, spawns, and assignments before they are processed by the network. The outbox manages the process's communication with other processes.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Message Forward"],
      "aliases": ["Message Queue", "Output Buffer"],
      "docs": []
    },
    {
      "term": "Message Tags",
      "definition": "Metadata attached to AO messages that provide context and instructions for message processing. Tags can be extractable or non-extractable, and forwardable or non-forwardable, affecting how messages are processed and routed.",
      "category": "AO Core Concepts",
      "related": ["Message", "Message Forward", "Process"],
      "aliases": ["Message Metadata", "Message Attributes"],
      "docs": []
    },
    {
      "term": "Message Normalization",
      "definition": "The process of standardizing message format in AO by extracting tags into a consistent structure and ensuring proper handling of message attributes. This enables reliable message processing across the network.",
      "category": "AO Core Concepts",
      "related": ["Message", "Message Tags", "Message Forward"],
      "aliases": ["Tag Extraction", "Message Standardization"],
      "docs": []
    },
    {
      "term": "Message Sanitization",
      "definition": "A security feature in AO that removes non-forwardable tags from messages before forwarding, ensuring that sensitive or system-specific information is not inappropriately propagated through the network.",
      "category": "AO Security",
      "related": ["Message", "Message Tags", "Message Forward"],
      "aliases": ["Tag Filtering", "Message Cleaning"],
      "docs": []
    },
    {
      "term": "Process Inbox",
      "definition": "A component of an AO process that stores incoming messages for processing. The inbox has a maximum capacity and implements overflow protection to prevent memory issues while maintaining message order.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Handler"],
      "aliases": ["Message Queue", "Input Buffer"],
      "docs": []
    },
    {
      "term": "Process Module",
      "definition": "A reusable component in AO that defines the behavior and capabilities of a process. Modules can be referenced and reused across different processes, providing standardized functionality and interfaces.",
      "category": "AO Development",
      "related": ["Process", "Spawn", "Handler"],
      "aliases": ["AO Module", "Process Template"],
      "docs": []
    },
    {
      "term": "Process Result",
      "definition": "The output of an AO process execution, including any generated messages, spawned processes, assignments, and error information. Results are used to coordinate process communication and manage state changes.",
      "category": "AO Core Concepts",
      "related": ["Process", "Message", "Spawn"],
      "aliases": ["Execution Result", "Process Output"],
      "docs": []
    },
    {
      "term": "Single System Image",
      "definition": "A unified computing environment in AO that creates a cohesive system across diverse nodes in a distributed network. This allows processes to operate independently while maintaining a unified user experience, similar to how websites on different servers are connected via hyperlinks.",
      "category": "AO Core Concepts",
      "related": ["Process", "Actor Model", "Distributed Computing"],
      "aliases": ["SSI", "Unified Computing Environment"],
      "docs": []
    },
    {
      "term": "Stake-Exclusivity Period",
      "definition": "A time window in AO during which staked collateral is exclusively reserved for a specific message transmission, preventing it from being reused. This mechanism ensures stake availability for potential slashing if discrepancies are found in the message.",
      "category": "AO Economics",
      "related": ["Staking", "Message", "Security Model"],
      "aliases": ["Lock Period", "Stake Lock"],
      "docs": []
    },
    {
      "term": "Time Value of Stake",
      "definition": "The economic cost in AO associated with locking stake capital for a specific duration to secure message transmission. This value is calculated based on the opportunity cost of the locked capital and expected annual return rates.",
      "category": "AO Economics",
      "related": ["Stake-Exclusivity Period", "Staking", "Message"],
      "aliases": ["Stake Time Value", "Capital Lock Cost"],
      "docs": []
    },
    {
      "term": "Permissionless Ecosystem Funding",
      "definition": "A token issuance mechanism in AO that allows developers to fund their applications by receiving AO tokens from users who bridge assets into their protocols. The funding rate automatically adjusts with the token emission curve.",
      "category": "AO Economics",
      "related": ["AO Token", "Bridge", "Ecosystem Development"],
      "aliases": ["PEF", "Protocol Funding"],
      "docs": []
    },
    {
      "term": "Permaweb Ecosystem Development Guild",
      "definition": "An alliance of organizations and builders in AO that develop and maintain core infrastructure, funded through native yield generated by bridged assets. The funding naturally decreases with token emission rate.",
      "category": "AO Economics",
      "related": ["Ecosystem Development", "Bridge", "AO Token"],
      "aliases": ["PEDG", "Development Guild"],
      "docs": []
    },
    {
      "term": "Pushing",
      "definition": "The process in AO where Messenger Units relay messages through the network, coordinating with Scheduler Units for message ordering and Compute Units for state calculation. This continues recursively until there are no more messages to process.",
      "category": "AO Core Concepts",
      "related": ["Message", "Messenger Unit", "Scheduler Unit"],
      "aliases": ["Message Pushing", "Message Relay"],
      "docs": []
    },
    {
      "term": "State Attestation",
      "definition": "A cryptographic assurance mechanism in AO that verifies the correctness of computations and states. In AO's state management, attestations are cryptographically signed statements by Compute Units verifying process state computation results. In the Converge Protocol, attestations provide cryptographic assurance that verifies the correctness of an output, representing proof that a specific computation produced the expected result when combined with the message and hashpath. Both forms enable trustless verification without requiring full recomputation.",
      "category": "AO Security",
      "related": ["Compute Unit", "Process", "State Management", "Hashpath", "Message", "Converge Protocol"],
      "aliases": ["State Attestation", "Computation Attestation"],
      "docs": []
    },
    {
      "term": "Bridge",
      "definition": "A system that enables assets from other networks to be represented and used within AO. Bridges consist of smart contracts on both the native chain and AO network, generating derivative tokens that represent the bridged assets. They facilitate cross-chain interoperability and asset transfer between different blockchain networks.",
      "category": "AO Core Infrastructure",
      "related": ["Token", "Cross-chain", "Asset Transfer", "AOX", "Quantum"],
      "aliases": ["Asset Bridge", "Token Bridge", "Cross-chain Bridge"],
      "docs": []
    },
    {
      "term": "AOX",
      "definition": "A general-purpose bridge that facilitates the transfer of assets from traditional exchanges and Ethereum to the AO network. It enables users to bring their assets from external networks into the AO ecosystem, expanding the range of assets available for use within AO.",
      "category": "AO Core Infrastructure",
      "related": ["Bridge", "Token", "Cross-chain", "Asset Transfer"],
      "aliases": ["AO Exchange Bridge"],
      "docs": ["https://aox.xyz/"]
    },
    {
      "term": "Quantum",
      "definition": "A bridge developed by Astro Protocol that enables the transfer of AR tokens from the Arweave network to the AO network. It facilitates seamless movement of Arweave's native token into the AO ecosystem, enabling users to leverage their AR holdings within AO-based applications and protocols.",
      "category": "AO Core Infrastructure",
      "related": ["Bridge", "Astro Protocol", "AR Token", "Asset Transfer"],
      "aliases": ["AR-AO Bridge"],
      "docs": ["https://bridge.astrousd.com/"]
    },
    {
      "term": "Cast Message",
      "definition": "A type of message in AO that is sent to a Scheduler Unit without waiting for a response, enabling one-way communication patterns. This allows for more efficient message passing when immediate responses aren't needed.",
      "category": "AO Core Concepts",
      "related": ["Message", "Scheduler Unit", "Message Forward"],
      "aliases": ["One-way Message", "Fire-and-forget Message"],
      "docs": []
    },
    {
      "term": "aoconnect",
      "definition": "A JavaScript/TypeScript library that enables interaction with the AO system from Node.js or browser environments. It provides a comprehensive set of tools and utilities for developers to interact with AO processes, send messages, and manage AO resources programmatically.",
      "category": "AO Development",
      "related": ["AO Process", "Message", "JavaScript", "TypeScript", "Node.js"],
      "aliases": ["AO Connect", "AO Client Library"],
      "docs": ["https://cookbook_ao.arweave.net/guides/aoconnect/aoconnect.html"]
    },
    {
      "term": "AO Dev-Cli",
      "definition": "A command-line tool for building AO WebAssembly modules, supporting both Lua and C/C++ development. It provides a streamlined workflow for initializing projects, building modules, and deploying them to the AO network. The tool features configurable build settings, external library support, and predefined memory presets for different use cases.",
      "category": "AO Development",
      "related": ["WebAssembly", "WASM", "Lua", "C/C++", "Module", "Build Tool"],
      "aliases": ["AO CLI", "AO Development CLI"],
      "docs": ["https://cookbook_ao.arweave.net/guides/dev-cli/index.html"]
    },
    {
      "term": "aos console",
      "definition": "A command-line interface tool for interacting with AO networks. It allows developers to deploy processes, send messages, and manage AO resources through terminal commands.",
      "category": "AO Development",
      "related": ["AOS", "Process", "Message"],
      "aliases": ["AO Console"],
      "docs": []
    },
    {
      "term": "DataItemSigner",
      "definition": "A function used to cryptographically sign data items before they're submitted to the AO network, ensuring authenticity and ownership.",
      "category": "AO Development",
      "related": ["Message", "Security Model", "Process"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "dryrun Parameter",
      "definition": "An API parameter that allows execution of operations without committing them to the blockchain, useful for testing and validation.",
      "category": "AO Development",
      "related": ["Process", "Message", "Handler"],
      "aliases": ["Test Mode"],
      "docs": []
    },
    {
      "term": "Relay Operator",
      "definition": "An entity that facilitates message transmission in the AO network, often requiring payment in the form of tokens to relay messages.",
      "category": "AO Core Infrastructure",
      "related": ["Messenger Unit", "Message", "AO Token"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Tag System",
      "definition": "The structured protocol for message routing in AO using key-value pairs. Common patterns include Action-Target-Quantity for token transfers and other operations.",
      "category": "AO Core Concepts",
      "related": ["Message Tags", "Message", "Handler Pattern"],
      "aliases": ["Tagging Protocol"],
      "docs": []
    },
    {
      "term": "Balances Implementation",
      "definition": "The pattern for implementing token balances within AO processes, typically using a Lua table with wallet addresses as keys.",
      "category": "AO Development",
      "related": ["Process", "Token", "AO Token"],
      "aliases": ["Token Ledger"],
      "docs": []
    },
    {
      "term": "Blueprints",
      "definition": "Templates in AOS that streamline the development of distributed applications by providing a framework for creating consistent and efficient processes across the AO network.",
      "category": "AO Development",
      "related": ["AOS", "Process", "Process Module", "Handler Pattern"],
      "aliases": ["AOS Blueprints", "Process Templates"],
      "docs": []
    },
    {
      "term": "AR Token",
      "definition": "The native cryptocurrency of the Arweave network used for transaction fees, data storage payments, and mining rewards. AR tokens are required to store data on the network, incentivize miners to maintain the blockweave, and participate in network governance. The token has a fixed maximum supply and its value is tied to the network's storage capacity. One AR is equal to one trillion (1,000,000,000,000) Winstons, which is the smallest unit of the token.",
      "category": "Arweave Technology",
      "related": ["Arweave", "Transaction", "Mining", "Storage Endowment", "Proof of Access", "Winston"],
      "aliases": ["AR", "$AR"],
      "docs": []
    },
    {
      "term": "Atomic Assets",
      "definition": "A unique data type on Arweave, linking data, metadata, and a smart contract under one identifier.",
      "category": "Arweave Technology",
      "related": ["SmartWeave", "Transaction", "Data Storage"],
      "aliases": ["Atomic Data"],
      "docs": []
    },
    {
      "term": "Arweave Gateway",
      "definition": "Nodes that provide HTTP access to data stored on the Arweave network.",
      "category": "Arweave Ecosystem",
      "related": ["Arweave", "Data Retrieval"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Proof of Access",
      "definition": "Arweave's consensus mechanism that combines proof of work with proof of storage.",
      "category": "Arweave Technology",
      "related": ["SPoRA", "Mining", "Blockweave"],
      "aliases": ["PoA"],
      "docs": []
    },
    {
      "term": "SmartWeave",
      "definition": "A smart contract platform for Arweave that uses lazy-evaluation.",
      "category": "Arweave Technology",
      "related": ["Arweave", "Warp", "Smart Contract"],
      "aliases": ["Arweave Smart Contracts"],
      "docs": []
    },
    {
      "term": "Succinct Proof of Random Access",
      "definition": "Arweave's current mining mechanism that combines proof of work with proof of storage.",
      "category": "Arweave Technology",
      "related": ["Proof of Access", "Mining", "Blockweave"],
      "aliases": ["SPoRA"],
      "docs": []
    },
    {
      "term": "Universal Data License",
      "definition": "Arweave's on-chain content licensing system.",
      "category": "Arweave Technology",
      "related": ["Data Storage"],
      "aliases": ["UDL"],
      "docs": []
    },
    {
      "term": "Verifiable Delay Function",
      "definition": "A cryptographic clock that provides a unique identifier to every node each second in the Arweave network.",
      "category": "Arweave Technology",
      "related": ["Mining", "Network Synchronization", "Security"],
      "aliases": ["VDF"],
      "docs": []
    },
    {
      "term": "Wallet",
      "definition": "A software application that allows users to store, send, and receive AR tokens, as well as interact with Arweave applications.",
      "category": "Arweave Technology",
      "related": ["AR Token", "Transaction", "Public Key"],
      "aliases": ["AR Wallet", "Arweave Wallet"],
      "docs": []
    },
    {
      "term": "Warp",
      "definition": "A smart contract execution environment for Arweave.",
      "category": "Arweave Technology",
      "related": ["SmartWeave", "Smart Contract", "Arweave"],
      "aliases": ["Warp Contracts"],
      "docs": []
    },
    {
      "term": "Weave",
      "definition": "The collective data stored on the Arweave network.",
      "category": "Arweave Technology",
      "related": ["Blockweave", "Data Storage", "Arweave"],
      "aliases": ["Arweave Weave"],
      "docs": []
    },
    {
      "term": "Wildfire",
      "definition": "Arweave's self-sustaining network participation reward system.",
      "category": "Arweave Technology",
      "related": ["Mining", "Network Incentives", "AR Token"],
      "aliases": ["Network Rewards"],
      "docs": []
    },
    {
      "term": "AO Package Manager",
      "definition": "A package manager for AO, enabling developers to manage and distribute AO modules and dependencies.",
      "category": "AO Development",
      "related": ["BetterIDEa", "AO Modules", "Process Module"],
      "aliases": ["APM"],
      "docs": ["https://apm_betteridea.arweave.net/"]
    },
    {
      "term": "AO Ventures",
      "definition": "A venture capital firm investing in projects within the AO ecosystem.",
      "category": "Organizations",
      "related": ["AO Ecosystem", "Venture Capital", "Ecosystem Development"],
      "aliases": ["AO VC"],
      "docs": ["https://www.aoventures.io/"]
    },
    {
      "term": "Arlink",
      "definition": "A decentralized data linking service utilizing Arweave for permanent data storage and retrieval.",
      "category": "Arweave Ecosystem",
      "related": ["Arweave", "Data Linking"],
      "aliases": ["Permanent Data Links"],
      "docs": ["https://arlink.arweave.net/"]
    },
    {
      "term": "Autonomous Finance",
      "definition": "A decentralized finance initiative utilizing AO technologies for autonomous financial operations.",
      "category": "Decentralized Finance",
      "related": ["AO Technologies", "Decentralized Finance", "Smart Contract"],
      "aliases": ["AO Finance", "Autonomous DeFi"],
      "docs": ["https://docs.autonomous.finance/"]
    },
    {
      "term": "Bazar",
      "definition": "A decentralized marketplace leveraging Arweave for data storage and management.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Marketplace", "Arweave"],
      "aliases": ["Decentralized Market"],
      "docs": ["https://bazar.arweave.net/"]
    },
    {
      "term": "BetterIDEa",
      "definition": "A native web-based IDE for AO development, featuring Lua language server integration and AO Package Manager support.",
      "category": "AO Development",
      "related": ["AO Package Manager", "Lua", "Development Tools"],
      "aliases": ["AO IDE", "Web IDE"],
      "docs": ["https://betteridea.dev/"]
    },
    {
      "term": "Botega",
      "definition": "A decentralized finance platform built on AO that facilitates asset exchanges through multiple models including AMMs and order books. Its unique architecture treats each liquidity pool as an independent process with localized state, enabling high-throughput transactions, autonomous execution of advanced orders, and AI integration. Botega is fully decentralized with its frontend on Arweave and execution logic in AO processes.",
      "category": "DeFi",
      "related": ["AO Process", "AMM", "Liquidity Pool", "Autonomous Agent", "Order Book", "Arweave", "Decentralized Exchange"],
      "aliases": ["Botega Exchange", "AO DeFi Platform"],
      "docs": ["https://botega.arweave.net", "https://botega.arweave.dev", "https://botega.ar.io"]
    },
    {
      "term": "Community Labs",
      "definition": "A collaborative group dedicated to advancing the permaweb ecosystem.",
      "category": "Organizations",
      "related": ["Permaweb Ecosystem", "Development", "Infrastructure"],
      "aliases": ["CL"],
      "docs": ["https://www.communitylabs.com/"]
    },
    {
      "term": "LiquidOps",
      "definition": "An over collateralised lending and borrowing protocol built on Arweave and AO.",
      "category": "DeFi",
      "related": ["Community Labs", "Botega", "Permaswap"],
      "aliases": ["Arweave lending", "Yield"],
      "docs": ["https://www.liquidops.io/"]
    },
    {
      "term": "Dexi",
      "definition": "An autonomous application that aggregates real-time financial data from events within the AO network, including asset prices, token swaps, and liquidity fluctuations. The Dexi Terminal provides a web interface similar to TradingView for monitoring assets and trading tokens. AO applications can subscribe to Dexi's data agents to receive verifiable real-time data, eliminating the need for external oracles.",
      "category": "Decentralized Applications (dApps)",
      "related": ["AO Network", "Financial Data", "Data Aggregation", "Asset Trading", "Real-time Data", "Oracle"],
      "aliases": ["Dexi Terminal", "AO Financial Data Agent"],
      "docs": ["https://dexi.arweave.net/"]
    },
    {
      "term": "Forward Research",
      "definition": "A research organization exploring and expanding the capabilities of the AO network.",
      "category": "Organizations",
      "related": ["AO Network", "Research", "Development"],
      "aliases": ["FWD Research"],
      "docs": ["https://fwd.arweave.net/"]
    },
    {
      "term": "Longview Labs",
      "definition": "An organization focused on developing decentralized technologies and applications.",
      "category": "Organizations",
      "related": ["Decentralized Technologies", "Development", "Infrastructure"],
      "aliases": ["OnlyArweave"],
      "docs": ["https://www.longviewlabs.co/"]
    },
    {
      "term": "Odysee",
      "definition": "A decentralized video platform utilizing blockchain for content distribution. Currently being migrated to Arweave/AO via ArFleet.",
      "category": "Decentralized Applications (dApps)",
      "related": ["ArFleet", "Content Distribution", "Video Platform"],
      "aliases": ["Video Platform"],
      "docs": ["https://odysee.com/"]
    },
    {
      "term": "Permaswap",
      "definition": "A decentralized exchange built on the Arweave network, supporting transactions within the permaweb ecosystem.",
      "category": "Arweave Ecosystem",
      "related": ["Arweave", "Decentralized Exchange"],
      "aliases": ["Permanent DEX"],
      "docs": []
    },
    {
      "term": "Redstone",
      "definition": "A decentralized data analytics platform built on Arweave.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Arweave", "Data Analytics", "Oracle"],
      "aliases": ["Data Oracle"],
      "docs": ["https://ar.io/case-studies/redstone"]
    },
    {
      "term": "Trackgood",
      "definition": "A decentralized supply chain management system using Arweave for data integrity.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Supply Chain Management", "Arweave", "Data Integrity"],
      "aliases": ["Supply Chain Platform"],
      "docs": ["https://ar.io/case-studies/trackgood"]
    },
    {
      "term": "Wander",
      "definition": "A non-custodial Arweave and AO native wallet with extensive features. Wander is available as a browser extension, mobile application, and embedded smart account.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Arweave", "Wallet", "ArNS"],
      "aliases": ["ArConnect", "Wander Wallet"],
      "docs": ["https://www.wander.app/"]
    },
    {
      "term": "Beacon",
      "definition": "The most secure wallet for AO and AR networks, offering features such as two-factor authentication (2FA), multi-signature capabilities, passkeys, recovery options, and more to ensure robust security.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Blockchain", "Wallet", "Security"],
      "aliases": ["Multi-chain Wallet", "Advanced Security Wallet"],
      "docs": ["https://beaconwallet.app/"]
    },
    {
      "term": "GraphQL for Arweave",
      "definition": "A query language used to interact with Arweave data in a flexible and efficient manner, allowing developers to specify exactly what data they need.",
      "category": "Arweave Technology",
      "related": ["Query Language", "Data Retrieval", "Indexing", "Gateway"],
      "aliases": ["Arweave GraphQL", "AR GraphQL"],
      "docs": ["https://cookbook.arweave.net/concepts/queryTransactions.html"]
    },
    {
      "term": "Multi-sig",
      "definition": "A multi-signature wallet or smart contract that requires multiple signatures or approvals from different parties before executing a transaction or action. This enhances security and control by distributing decision-making authority.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Wallet", "Smart Contract", "Security"],
      "aliases": ["Multi-signature"],
      "docs": []
    },
    {
      "term": "Permaweb Journal",
      "definition": "An on-chain publication and knowledge hub focused on the Arweave and AO ecosystem. It serves as a central resource for news, insights, and developments within the permaweb community.",
      "category": "Arweave Ecosystem",
      "related": ["Arweave", "AO Ecosystem", "On-chain Publication"],
      "aliases": [],
      "docs": ["https://permaweb-journal.arweave.net"]
    },
    {
      "term": "Lua",
      "definition": "A lightweight, embeddable scripting language used in AO for process development. Lua is utilized within the AO environment for writing process code and interacting with the AO system.",
      "category": "AO Development",
      "related": ["AO Process", "Scripting Language", "BetterIDEa"],
      "aliases": [],
      "docs": ["https://cookbook_ao.arweave.net/references/lua.html"]
    },
    {
      "term": "Under_names",
      "definition": "ANT owners and controllers can configure multiple subdomains for their registered ArNS name known as \"under_names\" or more easily written \"undernames\". These undernames are assigned individually at the time of registration or can be added on to any registered name at any time. Under_names use an underscore \"_\" in place of a more typically used dot \".\" to separate the subdomain from the main ArNS domain.",
      "category": "AR.IO Ecosystem",
      "related": ["ArNS", "Subdomains", "ANT"],
      "aliases": ["Undernames"],
      "docs": ["https://docs.ar.io/arns"]
    },
    {
      "term": "Permaweb Glossary",
      "definition": "A comprehensive reference guide for the Arweave and AO ecosystem, providing detailed explanations of key terms, concepts, and technologies. It serves as an educational resource for developers, users, and community members to better understand the permaweb ecosystem. A key feature is its portability - the glossary can be embedded in other websites and applications via iframes, making it easily accessible across the permaweb.",
      "category": "Arweave Ecosystem",
      "related": ["Permaweb", "Arweave", "AO Ecosystem", "Documentation", "Embedding"],
      "aliases": ["AO Glossary", "Arweave Glossary", "Embeddable Glossary"],
      "docs": ["https://github.com/dpshade/permaweb-glossary"]
    },
    {
      "term": "Protocol.Land",
      "definition": "Decentralized, source controlled, code collaboration where you own your code.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Code Collaboration", "Source Control", "Decentralized Development"],
      "aliases": ["Protocol Land", "Arweave Github"],
      "docs": ["https://protocol.land/"]
    },
    {
      "term": "Stablecoin",
      "definition": "A type of cryptocurrency designed to maintain a stable value relative to a specific asset or basket of assets, typically a fiat currency like the US dollar. Stablecoins provide price stability while leveraging the benefits of blockchain technology, making them useful for trading, payments, and as a store of value in the crypto ecosystem.",
      "category": "DeFi",
      "related": ["USDA", "Cryptocurrency", "DeFi", "Token"],
      "aliases": ["Stable Token", "Price-stable Cryptocurrency"],
      "docs": []
    },
    {
      "term": "USDA",
      "definition": "Astro USD, or USDA, is an AO-native stablecoin used to transact, facilitate, and interact with various other DeFi protocols in the ecosystem, while acting as a store of value, a medium of exchange, and a unit of account. USDA is a stablecoin backed by assets within the Arweave and AO ecosystems. It leverages Arweave's decentralized storage and AO's smart contract-like processes for secure and efficient value exchange, balancing transparency and decentralization.",
      "category": "DeFi",
      "related": ["Astro Protocol", "AO Token", "DeFi", "Stablecoin"],
      "aliases": ["Astro USD"],
      "docs": ["https://docs.astrousd.com/astro-protocol/what-is-usda"]
    },
    {
      "term": "Astro Protocol",
      "definition": "A blockchain-based framework that enables the minting of stablecoins and synthetic assets, backed by on-chain collateral stored and managed by processes developed within the AO compute environment. Astro introduces dynamic liquidation processes and stability modules to enhance system resilience and user trust.",
      "category": "DeFi",
      "related": ["USDA", "AO Process", "DeFi", "Stablecoin"],
      "aliases": ["Astro"],
      "docs": ["https://docs.astrousd.com/"]
    },
    {
      "term": "Data Item",
      "definition": "A standardized data format defined in the ANS-104 bundle specification, used as the preferred storage format for Arweave bundles. Data items are signed pieces of data that can be bundled together for efficient storage on Arweave. In AO, messages are implemented as data items with specific protocol tags, making them the foundation of process communication and state management.",
      "category": "Arweave Technology",
      "related": ["ANS-104", "Bundle", "AO Message", "Arweave", "Data Storage"],
      "aliases": ["ANS-104 Data Item", "Bundled Data Item", "DataItem"],
      "docs": ["https://specs.g8way.io/?tx=xwOgX-MmqN5_-Ny_zNu2A8o-PnTGsoRb_3FrtiMAkuw"]
    },
    {
      "term": "AO Link",
      "definition": "A fully decentralized transaction explorer for the AO network (accessible at aolink.ar.io or ao.link) that provides real-time visualization and interaction with on-chain messages and computations. It features message exploration, graphical visualization of message relationships, manual message interaction capabilities, and real-time streaming of network activity. The platform enables users to view token balances, process inboxes, and inspect process code, offering comprehensive insight into the AO network's operations.",
      "category": "AO Development",
      "related": ["Message", "Process", "Transaction", "Gateway", "Explorer"],
      "aliases": ["AOLink", "ao.link", "AO Explorer", "AO Transaction Explorer"],
      "docs": ["https://ao.link"]
    },
    {
      "term": "AO Teal",
      "definition": "A typed version of Lua for AO development, similar to TypeScript for JavaScript, that adds static type checking and annotations to enhance code safety and reliability. It includes features for secure coding practices and integrates with a biginteger implementation for precise handling of large numbers in financial applications. Teal enables developers to write more robust and maintainable code for AO processes.",
      "category": "AO Development",
      "related": ["Lua", "TypeScript", "AO Process", "Development Tools", "Type System"],
      "aliases": ["Teal", "Typed Lua", "AO Typed Lua"],
      "docs": ["https://docs.autonomous.finance/products/ecosystem-tooling/ao-teal"]
    },
    {
      "term": "AO Form",
      "definition": "A declarative infrastructure management tool for the AO ecosystem, similar to Terraform, that enables developers to deploy and upgrade multiprocess systems through a single configuration file. It provides state management for deployments, efficient component upgrades, and streamlined infrastructure maintenance, making it essential for managing complex AO process networks and optimizing development workflows.",
      "category": "AO Development",
      "related": ["Process", "Infrastructure Management", "Deployment", "State Management", "Configuration"],
      "aliases": ["AOForm", "AO Infrastructure as Code", "AO Deployment Tool"],
      "docs": ["https://docs.autonomous.finance/products/ecosystem-tooling/ao-form"]
    },
    {
      "term": "Basejump",
      "definition": "A social gaming platform built on AO that features the Action substrate. It provides a no-code environment for creating, discovering, and monetizing interoperable games and assets. Basejump is consumer-focused with an avatar-centric interface, featuring a PVP battle game for hyperobjects that runs in Discord and on the web.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Action", "Hyperobject", "AO Computer", "Arweave", "AI", "Gaming", "Social Platform", "Game Development"],
      "aliases": ["Basejump.xyz", "Action Gaming Platform"],
      "docs": ["https://www.basejump.xyz/"]
    },
    {
      "term": "AO-Core Protocol",
      "definition": "The underlying protocol that HyperBEAM implements, enabling decentralized computing and communication between nodes. AO-Core provides a framework into which any number of different computational models, encapsulated as primitive devices, can be attached.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Device", "Decentralized Computing"],
      "aliases": ["AO-Core", "AO Core", "Core Protocol"],
      "docs": ["https://permaweb.github.io/HyperBEAM/hyperbeam"]
    },
    {
      "term": "Asynchronous Message Passing",
      "definition": "A communication paradigm where senders don't wait for receivers to be ready, allowing for non-blocking operations and better scalability. This enables efficient process communication in distributed systems.",
      "category": "AO Core Concepts",
      "related": ["Message", "Process", "Communication"],
      "aliases": ["Non-blocking Communication"],
      "docs": ["https://permaweb.github.io/HyperBEAM/hyperbeam"]
    },
    {
      "term": "Checkpoint",
      "definition": "A saved state of a process that can be used to resume execution from a known point, used for persistence and recovery. This enables process state preservation and restoration capabilities.",
      "category": "AO Core Concepts",
      "related": ["Process", "State Management", "Recovery"],
      "aliases": ["State Checkpoint", "Process Snapshot"],
      "docs": ["https://permaweb.github.io/HyperBEAM/hyperbeam"]
    },
    {
      "term": "Decentralized Execution",
      "definition": "The ability to run processes across a distributed network without centralized control or coordination. This enables truly distributed computing capabilities in the HyperBEAM ecosystem.",
      "category": "AO Core Concepts",
      "related": ["Process", "Node", "Distributed Computing"],
      "aliases": ["Distributed Execution"],
      "docs": ["https://permaweb.github.io/HyperBEAM/hyperbeam"]
    },
    {
      "term": "Erlang",
      "definition": "The programming language used to implement the HyperBEAM core, known for its robustness and support for building distributed, fault-tolerant applications. It provides the foundation for HyperBEAM's reliable message passing and process management.",
      "category": "AO Development",
      "related": ["HyperBEAM", "Message Passing", "Process Management"],
      "aliases": [],
      "docs": ["https://permaweb.github.io/HyperBEAM/hyperbeam"]
    },
    {
      "term": "~json-iface@1.0",
      "definition": "A device in HyperBEAM that offers a translation layer between the JSON-encoded message format used by legacy versions and HyperBEAM's native HTTP message format.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Message", "Protocol"],
      "aliases": ["JSON Interface Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/hyperbeam"]
    },
    {
      "term": "HTTP Message Signature",
      "definition": "A standardized method (RFC9421) for creating, encoding, and verifying digital signatures within HTTP messages, crucial for the security model of HyperBEAM and the AO-Core protocol. In HyperBEAM, HTTP Signed Messages are used to authenticate node configuration changes, verify message integrity, and establish trust between nodes. The hb_message module in HyperBEAM provides functionality to convert between different message formats, including HTTP Signed Messages, enabling secure communication across the decentralized network. This signature mechanism is fundamental to the attestation system that allows nodes to cryptographically prove the correctness of computations without requiring full recomputation.",
      "category": "AO Security",
      "related": ["HyperBEAM", "Message", "Attestation", "Security Model", "AO-Core Protocol", "Converge Protocol"],
      "aliases": ["HTTP Signatures", "RFC9421", "HTTP Signed Message"],
      "docs": ["https://datatracker.ietf.org/doc/html/rfc9421", "https://github.com/permaweb/HyperBEAM"]
    },
    {
      "term": "~p4@1.0",
      "definition": "A device that runs as a pre-processor and post-processor in HyperBEAM, enabling a framework for node operators to sell usage of their machine's hardware to execute AO-Core devices.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Hardware", "Node Operator"],
      "aliases": ["Hardware Access Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary/#p410"]
    },
    {
      "term": "Sam Williams",
      "definition": "The founder of Arweave and the creator of the AO Computer concept. He pioneered the development of the permaweb and decentralized storage technologies, leading the creation of both the Arweave network and the AO ecosystem. His vision has been instrumental in advancing decentralized computing and permanent data storage solutions.",
      "category": "People",
      "related": ["Arweave", "AO Computer", "Permaweb", "Forward Research"],
      "aliases": ["Arweave Founder", "AO Creator"],
      "docs": ["https://sam_metalinks.arweave.net/"]
    },
    {
      "term": "Fair Launch",
      "definition": "A cryptocurrency distribution method that ensures equal access and sustainable funding for projects without traditional gatekeepers or early investor advantages. In the AO ecosystem, fair launches enable projects to receive funding through the Permaweb Index, where users can allocate their AO yield to support development. This model promotes transparency and decentralization by avoiding pre-allocation, pre-mining, or insider advantages, while ensuring builders can secure sustainable funding. Projects launched this way receive tokens based on community allocation of yield, creating a more equitable system where success is tied directly to community support and utility rather than speculative investment.",
      "category": "Cryptocurrency",
      "related": ["Token Distribution", "Decentralization", "Transparency", "Permaweb Index", "AO Yield", "Pi Token"],
      "aliases": ["Fair Token Distribution", "Equitable Launch", "Fair Launch Projects"],
      "docs": ["https://mirror.xyz/0x1e444D0F55Faad65F5217C168352A65e1EEfF25a/FADVqBaCw_GhglwyuB9lK_eVcf6Zyz4OgZYfAhIiXc0"]
    },
    {
      "term": "Converge Protocol",
      "definition": "A minimal computation model that enables the permaweb to be interpreted as both a flat, permanent ledger of data and a mutable, reactive computation environment. It provides a single, shared system image that can be accessed and added to permissionlessly, focusing on the simplest possible representation of data and computation upon that data, tailored for Arweave's distributed environment and HTTP access methods.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "AO", "Message", "Device", "Hashpath"],
      "aliases": ["Converge"],
      "docs": ["https://github.com/permaweb/HyperBEAM/tree/main/docs"]
    },
    {
      "term": "Device",
      "definition": "A component in the Converge Protocol that specifies how a message should be interpreted. Each message may optionally state a Device which should be used by Converge-compatible systems to interpret its contents. If no Device is explicitly stated, it must be inferred as 'Message'. Every Device must implement functions with the names 'ID' and 'Keys'.",
      "category": "AO Core Infrastructure",
      "related": ["Converge Protocol", "Message", "HyperBEAM", "Stack Device"],
      "aliases": ["Converge Device"],
      "docs": []
    },
    {
      "term": "Hashpath",
      "definition": "A cryptographic memoization of the tree of executions that were the source of a given piece of data in the Converge Protocol. It is derived by cryptographically mixing two prior commitments, resulting in a short (32 bytes with SHA2-256) but verifiable reference to the entire computation tree.",
      "category": "AO Core Infrastructure",
      "related": ["Converge Protocol", "Message", "Attestation", "Path"],
      "aliases": ["Computation Path"],
      "docs": []
    },
    {
      "term": "Stack Device",
      "definition": "A special device in HyperBEAM that combines a series of devices on a message into a single 'stack' of executable transformations. When added as the highest Device tag on a message, it scans the remainder of the message's tags looking for and loading other messages it finds, passing through each element of the stack in turn during execution.",
      "category": "AO Core Infrastructure",
      "related": ["Device", "HyperBEAM", "Converge Protocol"],
      "aliases": ["Device Stack"],
      "docs": []
    },
    {
      "term": "Attestation",
      "definition": "A cryptographic assurance mechanism in AO that verifies the correctness of computations and states. In AO's state management, attestations are cryptographically signed statements by Compute Units verifying process state computation results. In the Converge Protocol, attestations provide cryptographic assurance that verifies the correctness of an output, representing proof that a specific computation produced the expected result when combined with the message and hashpath. Both forms enable trustless verification without requiring full recomputation.",
      "category": "AO Security",
      "related": ["Compute Unit", "Process", "State Management", "Hashpath", "Message", "Converge Protocol"],
      "aliases": ["State Attestation", "Computation Attestation"],
      "docs": []
    },
    {
      "term": "Path",
      "definition": "A way to reference messages in the Converge Protocol that starts from a given message and applies a series of additional messages on top of it. Each resulting message must have an ID resolvable via its device, enabling additional paths to be described atop the intermediate message. Paths are designed to be compatible with HTTP protocols.",
      "category": "AO Core Infrastructure",
      "related": ["Message", "Hashpath", "Converge Protocol"],
      "aliases": ["Message Path"],
      "docs": []
    },
    {
      "term": "Permissionlessness",
      "definition": "A property of computation systems where no actor in the ecosystem may be denied the ability to use the network by any other actor or group. This is a fundamental property of decentralized computation machines, though it can only be offered in degrees rather than absolutely.",
      "category": "AO Core Concepts",
      "related": ["Trustlessness", "Decentralization", "Converge Protocol"],
      "aliases": ["Permissionless Access"],
      "docs": []
    },
    {
      "term": "Trustlessness",
      "definition": "A property of computation systems where users can participate in the network without needing to trust other parties are not acting maliciously. Like permissionlessness, this is a fundamental property of decentralized computation machines that can only be offered in degrees rather than absolutely.",
      "category": "AO Core Concepts",
      "related": ["Permissionlessness", "Security", "Converge Protocol"],
      "aliases": ["Trustless Operation"],
      "docs": []
    },
    {
      "term": "~meta@1.0",
      "definition": "A configuration device in HyperBEAM that provides an interface for specifying a node's hardware, supported devices, metering, and payments information. It allows external clients to find and validate node configurations in the network, serving as the primary configuration mechanism for HyperBEAM nodes.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Device", "Node Configuration", "Hardware"],
      "aliases": ["Meta Device", "Configuration Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "~relay@1.0",
      "definition": "A device in HyperBEAM used to relay messages between nodes and the wider HTTP network. It provides an interface for sending and receiving messages using various execution strategies, facilitating communication across the network.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Message", "HTTP Network", "Communication"],
      "aliases": ["Relay Device", "Message Relay"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "~wasm64@1.0",
      "definition": "A device in HyperBEAM that executes WebAssembly code using the Web Assembly Micro-Runtime (WAMR). It enables the execution of WASM modules from any other device and supports devices written in languages like Rust, C, and C++.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "WebAssembly", "WASM", "WAMR", "Runtime"],
      "aliases": ["WASM Device", "WebAssembly Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary/#wasm6410"]
    },
    {
      "term": "~compute-lite@1.0",
      "definition": "A lightweight device in HyperBEAM that wraps a local WASM executor, used for executing legacy AO processes. It enables compatibility with older AO network processes within the HyperBEAM environment.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "WASM", "Legacy AO", "Process"],
      "aliases": ["Compute Lite Device", "Legacy Executor"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary/#compute-lite10"]
    },
    {
      "term": "~snp@1.0",
      "definition": "A device in HyperBEAM used to generate and validate proofs that a node is executing inside a Trusted Execution Environment (TEE). It enables trust-minimized attestations of AO-Core executions using ephemeral key pairs that exist only within the TEE.",
      "category": "AO Security",
      "related": ["HyperBEAM", "TEE", "Attestation", "Security"],
      "aliases": ["SNP Device", "TEE Proof Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "Trustless Execution",
      "definition": "A property of computation systems where users can participate in the network without needing to trust other parties are not acting maliciously. Like permissionlessness, this is a fundamental property of decentralized computation machines that can only be offered in degrees rather than absolutely.",
      "category": "AO Core Concepts",
      "related": ["Permissionlessness", "Security", "Converge Protocol"],
      "aliases": ["Trustless Operation"],
      "docs": []
    },
    {
      "term": "~simple-pay@1.0",
      "definition": "A simple, flexible pricing device in HyperBEAM that can be used with p4@1.0 to offer flat-fees for the execution of AO-Core messages. It provides a straightforward mechanism for monetizing node services.",
      "category": "AO Economics",
      "related": ["HyperBEAM", "p4@1.0", "Pricing", "Node Services"],
      "aliases": ["Simple Payment Device", "Flat-fee Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "~faff@1.0",
      "definition": "A simple pricing and ledger device for p4@1.0 in HyperBEAM that allows nodes to offer access to their services only to a specific set of users. It's useful for personal use or servicing specific applications.",
      "category": "AO Economics",
      "related": ["HyperBEAM", "p4@1.0", "Pricing", "Access Control"],
      "aliases": ["FAFF Device", "Restricted Access Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "scheduler@1.0",
      "definition": "A device in HyperBEAM used to assign a linear hashpath to an execution, ensuring deterministic ordering that all users can access. It enables the creation of executions that mirror traditional smart contracting networks when used with other AO-Core devices.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Hashpath", "Execution", "Ordering"],
      "aliases": ["Scheduler Device", "Execution Scheduler", "Scheduler", "Scheduler Unit"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "stack@1.0",
      "definition": "A device in HyperBEAM used to execute an ordered set of devices over the same inputs. It allows users to create complex combinations of other devices and apply them as a single unit with a single hashpath.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Device", "Hashpath", "Execution"],
      "aliases": ["Stack Device", "Device Stack"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "~process@1.0",
      "definition": "A device in HyperBEAM that enables users to create persistent, shared executions accessible by multiple users. It allows customization of execution and scheduler devices, supporting various execution patterns. It includes a push key for moving messages from a process's execution outbox into another execution's schedule.",
      "category": "AO Core Infrastructure",
      "related": ["HyperBEAM", "Process", "Execution", "Message"],
      "aliases": ["Process Device", "Shared Execution Device"],
      "docs": ["https://permaweb.github.io/HyperBEAM/reference/glossary"]
    },
    {
      "term": "ARIO Token",
      "definition": "The native cryptocurrency of the AR.IO Network that powers the world's first Permanent Cloud. With a fixed supply of 1 billion tokens, ARIO serves multiple functions: powering ecosystem operations, facilitating transactions, and incentivizing network participation. It enables critical operations like gateway staking, ArNS domain registrations, and protocol rewards distribution. The token follows a non-inflationary model where network revenue is recycled to fund rewards rather than minting new tokens. Each ARIO is divisible into 1,000,000 micro-ARIO (µARIO) units to support a wide range of transactions.",
      "category": "AR.IO Economics",
      "related": ["AR.IO", "Protocol Balance", "Protocol Rewards", "Staking", "Gateway", "ArNS"],
      "aliases": ["$ARIO"],
      "docs": ["https://ar.io/articles/ario-tokenomics-guide"]
    },
    {
      "term": "Armstrong",
      "definition": "The smallest unit of the AO Token. One AO is equal to one trillion (1,000,000,000,000) Armstrongs. When specifying token quantities in AO transactions, the amount is typically expressed in Armstrongs rather than AO tokens.",
      "category": "AO Economics",
      "related": ["AO Token", "Compute Payment", "Transaction"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "Winston",
      "definition": "The smallest unit of the AR Token (Arweave). One AR is equal to one trillion (1,000,000,000,000) Winstons. This denomination is similar to satoshis in Bitcoin and is used for precise calculations and transactions within the Arweave network.",
      "category": "Arweave Technology",
      "related": ["AR Token", "Transaction", "Data Storage", "Mining"],
      "aliases": [],
      "docs": []
    },
    {
      "term": "micro-ARIO",
      "definition": "The smallest unit of the ARIO Token. One ARIO is equal to one million (1,000,000) micro-ARIO. This subunit allows for precise calculations and transactions within the AR.IO Network, enabling granular token operations for services like gateway staking and ArNS domain registrations.",
      "category": "AR.IO Economics",
      "related": ["ARIO Token", "AR.IO", "Protocol Balance", "Staking", "ArNS"],
      "aliases": ["µARIO"],
      "docs": []
    },
    {
      "term": "Action",
      "definition": "A decentralized framework built on AO and Arweave designed for creating self-sovereign games, digital assets, and communities. Action introduces 'hyperobjects' (interoperable game assets like avatars, items, and environments) that can be used across different games and platforms. The ecosystem is powered by the ACTION token, which enables hyperobject creation, governance participation, and economic coordination. Action emphasizes originality, collaboration, and sustainability, with a portion of fees directed toward real-world environmental initiatives like rainforest protection.",
      "category": "Decentralized Applications (dApps)",
      "related": ["AO Computer", "Arweave", "Hyperobject", "ACTION Token", "Basejump"],
      "aliases": ["Action Substrate"],
      "docs": []
    },
    {
      "term": "ACTION Token",
      "definition": "The native utility token of the Action ecosystem with a fixed supply of 10 billion tokens. It enables hyperobject creation, marketplace transactions, governance participation, and ecosystem growth. Unlike traditional tokens, ACTION is designed primarily for platform utility rather than speculation, with 75% of the supply allocated to community distribution. The token follows a non-inflationary model and incorporates treasury mechanisms to fund environmental and social initiatives through community governance.",
      "category": "Cryptocurrency",
      "related": ["Action", "Hyperobject", "Governance", "AO Token"],
      "aliases": ["$ACTION"],
      "docs": []
    },
    {
      "term": "Hyperobject",
      "definition": "The foundational digital assets of the Action ecosystem that serve as building blocks for gameplay, commerce, and creativity. Hyperobjects include avatars ('Action Figures'), game assets ('Action Items'), and game environments ('Worlds'). Unlike traditional NFTs, hyperobjects can be large applications due to AO's scalability, and they exhibit context-dependent behavior, adapting dynamically to the specific game or world in which they're used. Each hyperobject runs as a unique AO process with corresponding Arweave data representing its underlying assets.",
      "category": "Decentralized Applications (dApps)",
      "related": ["Action", "ACTION Token", "AO Process", "Digital Asset"],
      "aliases": ["Action Hyperobject"],
      "docs": []
    },
    {
      "term": "Merkle Root",
      "definition": "The result of hashing all transactions in a block, pairing those hashes, and hashing them again until a single hash remains. In blockchain systems like Arweave and AO, Merkle roots enable efficient verification of transaction data without requiring nodes to process every transaction individually. This technique significantly reduces the computational resources needed to verify blocks and is central to maintaining blockchain integrity. In the Converge Protocol, HashPaths use Merkle tree principles to create a cryptographic history of all operations that led to a particular state, allowing verification of the entire computation chain with a single hash.",
      "category": "Blockchain Technology",
      "related": ["Hashpath", "Transaction", "Block", "Converge Protocol", "Data Verification"],
      "aliases": ["Merkle Tree", "Hash Tree", "Merkle"],
      "docs": []
    },
    {
      "term": "AO Yield",
      "definition": "A customizable reward system in the AO ecosystem that allows users to earn tokens based on their Arweave (AR) holdings and deposited assets (like stETH and DAI). Users can allocate their yield to different options: PI (receiving diversified exposure through the Permaweb Index), AO (continuing to earn AO tokens), AR (converting yield to Arweave tokens), or specific fair launch projects. When allocated to ecosystem projects, the yield helps fund development while users receive project tokens in return. The system operates through trustless, audited contracts on Ethereum for bridged assets, with deposits remaining withdrawable at any time.",
      "category": "AO Economics",
      "related": ["AO Token", "Pi Token", "Permaweb Index", "Fair Launch", "Bridge", "AOX"],
      "aliases": ["Yield Allocation", "AO Rewards"],
      "docs": []
    },
    {
      "term": "Permaweb Index",
      "definition": "A fair launch funding mechanism for the permaweb ecosystem, launched on Pi Day (3.14). It introduces a new model for funding crypto projects where users can allocate their AO yield to support ecosystem development. The index is represented by the PI token, which provides diversified exposure to key permaweb assets: 33.3% AO, 33.3% Arweave (AR), and 33.3% fair launch projects. This structure enables builders to secure sustainable development funding while allowing community members to support projects they believe in, all while maintaining broad exposure to the ecosystem's growth through a single token.",
      "category": "AO Economics",
      "related": ["Pi Token", "AO Token", "AO Yield", "Fair Launch", "Ecosystem Development"],
      "aliases": ["PI", "Permaweb Token Index"],
      "docs": []
    },
    {
      "term": "ArDrive",
      "definition": "A decentralized storage application built on Arweave that enables users to store and manage their files permanently. It offers a pay-once, store-forever model, eliminating the need for recurring subscription fees. ArDrive provides true data ownership, ensuring files remain accessible even if the company disappears, and supports both private and public data storage options. The platform is optimized for storing various types of data, including photography, digital art, and NFTs.",
      "category": "Arweave Ecosystem",
      "related": ["Arweave", "Permaweb", "Data Storage", "NFT Storage", "Decentralized Storage", "ArFS"],
      "aliases": ["ArDrive Platform", "Permanent Storage App"],
      "docs": ["https://ardrive.io/"]
    },
    {
      "term": "ArDrive CLI",
      "definition": "A command-line interface tool for interacting with ArDrive, enabling users to upload, download, and manage files on the Arweave network programmatically. It provides a powerful way to automate file operations and integrate ArDrive functionality into scripts and applications.",
      "category": "Arweave Development",
      "related": ["ArDrive", "CLI", "File Management", "Arweave"],
      "aliases": ["ArDrive Command Line Tool"],
      "docs": ["https://ardrive.io/ardrive-cli/"]
    },
    {
      "term": "ArDrive Turbo",
      "definition": "An enhanced version of ArDrive that provides faster upload speeds and improved performance for large files. It optimizes the upload process by implementing advanced bundling and chunking techniques, making it more efficient for handling substantial amounts of data.",
      "category": "Arweave Ecosystem",
      "related": ["ArDrive", "Data Upload", "Performance", "Arweave"],
      "aliases": ["Turbo Upload", "Fast ArDrive"],
      "docs": ["https://ardrive.io/turbo/"]
    },
    {
      "term": "ArDrive Core",
      "definition": "The fundamental library that provides the core functionality for interacting with ArDrive. It includes essential features for file management, data encryption, and Arweave integration, serving as the foundation for both the ArDrive web application and CLI tools.",
      "category": "Arweave Development",
      "related": ["ArDrive", "ArFS", "File Management", "Arweave"],
      "aliases": ["ArDrive Library", "Core Library"],
      "docs": ["https://ardrive.io/core/"]
    }
  ]
}
